In [40]:
import scipy
import pandas as pd
import numpy as np

In [5]:
class student:
    def __init__(self, name, math, science, reading, history):
        self.name = name
        self.math = math
        self.science = science
        self.reading = reading
        self.history = history

In [8]:
grades = [{"Name": "Adam", "Math":11, "Science":9, "Reading":16, "History":13.5},
         {"Name": "Anna", "Math":12, "Science":11, "Reading":8.5, "History":10},
         {"Name": "James", "Math":11, "Science":18, "Reading":11.5, "History":9},
         {"Name": "Corey", "Math":7, "Science":15.5, "Reading":11, "History":14},
         {"Name": "Alisha", "Math":9.5, "Science":12, "Reading":10.5, "History":14},
         {"Name": "Jodie", "Math":15, "Science":18.5, "Reading":7, "History":12},
         {"Name": "John", "Math":18, "Science":15.5, "Reading":11, "History":7.5}]

df = pd.DataFrame(grades)
display(df)

     Name  Math  Science  Reading  History
0    Adam  11.0      9.0     16.0     13.5
1    Anna  12.0     11.0      8.5     10.0
2   James  11.0     18.0     11.5      9.0
3   Corey   7.0     15.5     11.0     14.0
4  Alisha   9.5     12.0     10.5     14.0
5   Jodie  15.0     18.5      7.0     12.0
6    John  18.0     15.5     11.0      7.5

In [15]:
df_mean = df[['Math', 'Science', 'Reading', 'History']]
display(df_mean.mean())

Math       11.928571
Science    14.214286
Reading    10.785714
History    11.428571
dtype: float64

In [16]:
display(df)

     Name  Math  Science  Reading  History
0    Adam  11.0      9.0     16.0     13.5
1    Anna  12.0     11.0      8.5     10.0
2   James  11.0     18.0     11.5      9.0
3   Corey   7.0     15.5     11.0     14.0
4  Alisha   9.5     12.0     10.5     14.0
5   Jodie  15.0     18.5      7.0     12.0
6    John  18.0     15.5     11.0      7.5

In [18]:
display(df['Name'])

0      Adam
1      Anna
2     James
3     Corey
4    Alisha
5     Jodie
6      John
Name: Name, dtype: object

In [19]:
display(df['Math'].median())

11.0

In [20]:
display(df['History'].mode())

0    14.0
Name: History, dtype: float64

In [27]:
# grades_df = df[['Math', 'Science', 'Reading', 'History']]
# grades_df.corr()

df[['Math', 'Science', 'Reading', 'History']].corr()

             Math   Science   Reading   History
Math     1.000000  0.269494 -0.268562 -0.718358
Science  0.269494  1.000000 -0.527606 -0.358688
Reading -0.268562 -0.527606  1.000000  0.206794
History -0.718358 -0.358688  0.206794  1.000000

In [62]:
import statistics as st
test_grades = [24, 5, 15, 60, 54, 82, 99, 80, 70, 98, 93, 60, 33, 22, 65, 61, 51, 58, 83, 86, 42, 67, 60]

def desc_stats(x):
    mean = st.mean(x)
    print(f'mean: {mean}')
    median = st.median(x)
    print(f'median: {median}')
    mode = st.mode(x)
    print(f'mode: {mode}')
    minimum = np.min(x)
    print(f'minimum: {minimum}')
    maximum = np.max(x)
    print(f'max: {maximum}')
    range = maximum - minimum
    print(f'range: {range}')
    variance = st.pvariance(x)
    print(f'variance: {variance}')
    deviation = st.stdev(x)
    print(f'deviation: {deviation}')

In [63]:
desc_stats(test_grades)

mean: 59.47826086956522
median: 60
mode: 60
minimum: 5
max: 99
range: 94
variance: 664.1625708884688
deviation: 26.350555566365703